local localization = {
	--Mod Name
	["CMSName"] = "Car Modification Shop",
	
	--Part Types
	[“Engine”] = “محرك”, 
	[“Ecu”] = “وحدة التحكم الإلكترونية”, 
	[“Transmission”] = “نقل”, 
	[“Suspension”] = “تعليق”, 
	[“Tires”] = “إطارات”, 
	[“Brakes”] = “الفرامل”, 
	[“Weight Reduction”] = “تخفيض الوزن”, 
	[“Stage”] = “مرحلة”,
	
	--Totals text
	["basetotalTorqueText"] = "عزم الدوران: ",
	["basetotalGearsText"] = "التروس: ",
	["basetotalHeightText"] = "الارتفاع: ",
	["basetotalWeightText"] = "الوزن: ",
	["basetotalTractionText"] = "جر الإطارات: ",
	["basetotalBrakePowerText"] = "عزم الدوران الفرامل: ",
	["basetotalPriceText"] = "عربة التسوق: \n€$ ",
	
	--Main UI Text
	["ClearAllUpgrades"] = "إزالة جميع التحديثات",
	["StopUpgradeClear"] = "إيقاف تحديث المسح",
	["ButtonStartDowngrading"] = "بدء إلغاء التثبيت",
	["ButtonStopDowngrading"] = "إيقاف إلغاء التثبيت",
	["ButtonAcceptBroke"] = "استمر",
	["ButtonReturn"] = "الصفحة السابقة",
	["ButtonConfirmUpgrade"] = "تأكيد التحديث",
	["CloseUIButton"] = "     إغلاق",
	["partBasketMainTextToSet"] = "سلة الأجزاء:",
	["partListMainTextToSet"] = "الأجزاء المحدثة:",
	["descriptionPrice"] = "السعر: ",
	["brokeConfirmBox"] = "عدد EDDIES CHOOM غير كافٍ\n   احصل على بعض EDDIES\n        ثم نتحدث",
	["ButtonClearBasket"] = "مسح السلة",
	
	--MAP UI
	["mapTitleText"] = "كراج السيارات",
	["mapDescText"] = "حسّن مركباتك ودع الجميع يأكلون الغبار في هذه المدينة!",
	["ButtonClearBasket"] = "مسح السلة",

	--Parts names and desc
	
	--Engine
	["PartName-0101"] = "سحب الهواء البارد",
	["PartDesc-0101"] = "تحسين طفيف لعزم الدوران المحرك",

	["PartName-0102"] = "استبدال الرؤوس",
	["PartDesc-0102"] = "تحسين طفيف لعزم الدوران المحرك",

	["PartName-0103"] = "عمود الحدبات وتروس الحدبات",
	["PartDesc-0103"] = "تحسين طفيف لعزم الدوران المحرك",

	["PartName-0104"] = "عادم عالي الأداء",
	["PartDesc-0104"] = "تحسين طفيف لعزم الدوران المحرك",

	["PartName-0121"] = "نظام توربو المستوى 1",
	["PartDesc-0121"] = "تحسين متوسط لعزم الدوران المحرك",

	["PartName-0105"] = "نظام عادم Cat Back",
	["PartDesc-0105"] = "تحسين متوسط لعزم الدوران المحرك",

	["PartName-0106"] = "سحب عالي التدفق",
	["PartDesc-0106"] = "تحسين طفيف لعزم الدوران المحرك",

	["PartName-0107"] = "قطر أكبر للأنابيب الهابطة",
	["PartDesc-0107"] = "تحسين طفيف لعزم الدوران المحرك",

	["PartName-0122"] = "نظام توربو المستوى 2",
	["PartDesc-0122"] = "تحسين واسع جدًا لعزم الدوران المحرك",

	["PartName-0108"] = "عمود حدبات سباق وتروس عمود حدبات",
	["PartDesc-0108"] = "تحسين متوسط لعزم الدوران المحرك",

	["PartName-0109"] = "صقل قنوات رأس الأسطوانة",
	["PartDesc-0109"] = "تحسين متوسط لعزم الدوران المحرك",

	["PartName-0110"] = "تصميم كتلة المحرك",
	["PartDesc-0110"] = "تحسين متوسط لعزم الدوران المحرك",

	["PartName-0111"] = "رؤوس عالية التدفق",
	["PartDesc-0111"] = "تحسين متوسط لعزم الدوران المحرك",

	["PartName-0123"] = "نظام توربو مزدوج المستوى 3",
	["PartDesc-0123"] = "تحسين شديد لعزم الدوران المحرك",

	--ECU
	["PartName-0201"] = "منظم ضغط الوقود",
	["PartDesc-0201"] = "تحسين متوسط لعزم الدوران المحرك",

	["PartName-0202"] = "قضيب الوقود",
	["PartDesc-0202"] = "تحسين طفيف لعزم الدوران المحرك",

	["PartName-0203"] = "فلتر الوقود",
	["PartDesc-0203"] = "تحسين طفيف لعزم الدوران المحرك",

	["PartName-0204"] = "شريحة التحسين",
	["PartDesc-0204"] = "تحسين واسع لعزم الدوران المحرك",

	["PartName-0205"] = "مضخة الوقود عالية التدفق",
	["PartDesc-0205"] = "تحسين طفيف لعزم الدوران المحرك",

	["PartName-0206"] = "وحدة التحكم في المحرك",
	["PartDesc-0206"] = "تحسين شديد لعزم الدوران المحرك",

	["PartName-0207"] = "الموزعات الوقود",
	["PartDesc-0207"] = "تحسين متوسط لعزم الدوران المحرك",
	
	--Transmission
	["PartName-0301"] = "مجموعة التحول القصير",
	["PartDesc-0301"] = "تقليل متوسط لوقت التروس",

	["PartName-0302"] = "مكبح المحرك المخفف",
	["PartDesc-0302"] = "تقليل واسع لوزن مكبح المحرك",

	["PartName-0305"] = "المشبك عالي الأداء",
	["PartDesc-0305"] = "تقليل واسع لوقت التروس",

	["PartName-0306"] = "ناقل الحركة عالي الأداء",
	["PartDesc-0306"] = "تروس إضافية ، تحسين السرعة القصوى",
 	
	--Suspension
	["PartName-0401"] = "الينابيع الرياضية والمخمدات",
	["PartDesc-0401"] = "تقليل منخفض للتخفيض",

	["PartName-0402"] = "عمود الدعم الثنائي",
	["PartDesc-0402"] = "تحسين طفيف للتعليق",

	["PartName-0403"] = "الينابيع عالية الأداء والمخمدات",
	["PartDesc-0403"] = "تقليل متوسط للتخفيض",

	["PartName-0404"] = "مثبتات أمامية وخلفية",
	["PartDesc-0404"] = "تحسين طفيف لصلابة المثبت",

	["PartName-0405"] = "نظام التعليق Coilover",
	["PartDesc-0405"] = "تقليل عالي للتخفيض",

	["PartName-0406"] = "مثبتات كبيرة",
	["PartDesc-0406"] = "تحسين واسع لصلابة المثبت",
			
	--Tires
	["PartName-0501"] = "إطارات الشوارع",
	["PartDesc-0501"] = "تحسين متوسط للتصاق الإطارات",

	["PartName-0502"] = "إطارات نصف سليك",
	["PartDesc-0502"] = "تحسين واسع للتصاق الإطارات",

	["PartName-0503"] = "إطارات سليك",
	["PartDesc-0503"] = "تحسين شديد للتصاق الإطارات",
	
	--Brakes
	["PartName-0601"] = "أقراص الفرامل المركبة للشوارع",
	["PartDesc-0601"] = "زيادة متوسطة في عزم الدوران الفرامل",

	["PartName-0602"] = "خراطيم الفرامل المضفرة بالفولاذ",
	["PartDesc-0602"] = "زيادة طفيفة في عزم الدوران الفرامل",

	["PartName-0603"] = "الدوارات المتقاطعة",
	["PartDesc-0603"] = "زيادة متوسطة في عزم الدوران الفرامل",

	["PartName-0604"] = "الدوارات ذات القطر الكبير",
	["PartDesc-0604"] = "زيادة واسعة في عزم الدوران الفرامل",

	["PartName-0605"] = "أقراص الفرامل السباقية",
	["PartDesc-0605"] = "زيادة واسعة في عزم الدوران الفرامل",

	["PartName-0606"] = "الدوارات المتشابكة والمحددة",
	["PartDesc-0606"] = "زيادة شديدة في عزم الدوران الفرامل",

	["PartName-0607"] = "6 مكابح المكابس",
	["PartDesc-0607"] = "زيادة شديدة في عزم الدوران الفرامل",
	
	--Weight Reduction
	["PartName-0801"] = "سجادة السيارة الخفيفة",
	["PartDesc-0801"] = "تقليل طفيف للوزن",

	["PartName-0802"] = "لوحات داخلية خفيفة",
	["PartDesc-0802"] = "تقليل طفيف للوزن",

	["PartName-0803"] = "نوافذ خفيفة",
	["PartDesc-0803"] = "تقليل متوسط للوزن",

	["PartName-0804"] = "مقاعد خفيفة",
	["PartDesc-0804"] = "تقليل متوسط للوزن",

	["PartName-0805"] = "أبواب خفيفة",
	["PartDesc-0805"] = "تقليل واسع للوزن",

	["PartName-0806"] = "الداخلية الرغوية",
	["PartDesc-0806"] = "تقليل متوسط للوزن",
	
	--Part Descriptions
	["Borpa"] = "Borpa"
}

return localization