local localization = {
	--Mod Name
	["CMSName"] = "Car Modification Shop",
	
	--Part Types
	["Engine"] = "Двигатель",
    ["Ecu"] = "Эбу",
    ["Transmission"] = "Трансмиссия",
    ["Suspension"] = "Подвеска",
    ["Tires"] = "Шины",
    ["Brakes"] = "Тормоза",
    ["Weight Reduction"] = "Уменьшение веса",
    ["Stage"] = "Stage",
	
	--Totals text
    ["basetotalTorqueText"] = "МОЩНОСТЬ: ",
    ["basetotalGearsText"] = "ПЕРЕДАЧИ: ",
    ["basetotalHeightText"] = "ВЫСОТА: ",
    ["basetotalWeightText"] = "ВЕС: ",
    ["basetotalTractionText"] = "СЦЕПЛЕНИЕ ШИН: ",
    ["basetotalBrakePowerText"] = "ТОРМОЗНАЯ МОЩНОСТЬ: ",
    ["basetotalPriceText"] = "КОРЗИНА: \n€$ ",
	
	--Main UI Text
    ["ClearAllUpgrades"] = "Убрать все апргейды",
    ["StopUpgradeClear"] = "Стоп апгрейды",
    ["ButtonStartDowngrading"] = "Начать даунгрейд",
    ["ButtonStopDowngrading"] = "Стоп даунгейдинг",
    ["ButtonAcceptBroke"] = "Продолжить",
    ["ButtonReturn"] = "Предыдущая страница",
    ["ButtonConfirmUpgrade"] = "Поставить апгрейд",
    ["CloseUIButton"] = "       Закрыть",
    ["partBasketMainTextToSet"] = "ЧАСТЬ КОРЗИНЫ:",
    ["partListMainTextToSet"] = "УЛУЧШЕННЫЕ ЧАСТИ:",
    ["descriptionPrice"] = "Стоимость: ",
    ["brokeConfirmBox"] = "НЕ ДОСТАТОЧНО ЭДДИ ЧУМБА\n    ДЛЯ НАЧАЛА ПОЛУЧИТЕ ЭДДИ\n        ТОГДА МОЖЕМ ПОГОВОРИТЬ",
    ["ButtonClearBasket"] = "Очистить корзину",
	
	--MAP UI
    ["mapTitleText"] = "Гараж машин",
    ["mapDescText"] = "Улучшайте свои автомобили и обгоняйте всех в городе!",

	--Parts names and desc
	
	--Engine
	["PartName-0101"] = "Забор Холод Воздуха",
	["PartDesc-0101"] = "Малое увеличение мощности двигателя",
			
	["PartName-0102"] = "Замена коллекторов",
	["PartDesc-0102"] = "Малое увеличение мощности двигателя",
			
	["PartName-0103"] = "Мягкий Вал и Шестерни",
	["PartDesc-0103"] = "Малое увеличение мощности двигателя",
			
	["PartName-0104"] = "Улучшенный Выхлоп",
	["PartDesc-0104"] = "Малое увеличение мощности двигателя",
			
	["PartName-0121"] = "Stage 1 Турбо Система",
	["PartDesc-0121"] = "Среднее увеличение мощности двигателя",
			
	["PartName-0105"] = "КатБэк Выхлоп Система",
	["PartDesc-0105"] = "Среднее увеличение мощности двигателя",
			
	["PartName-0106"] = "Коллектор с Высоким Расходом",
	["PartDesc-0106"] = "Малое увеличение мощности двигателя",
			
	["PartName-0107"] = "Увел Диаметр Водосточной Трубы",
	["PartDesc-0107"] = "Малое увеличение мощности двигателя",
				
	["PartName-0122"] = "Stage 2 Турбо Система",
	["PartDesc-0122"] = "Очень большое увеличение мощности двигателя",
				
	["PartName-0108"] = "Гоночный Вал и Шестерни",
	["PartDesc-0108"] = "Среднее увеличение мощности двигателя",
				
	["PartName-0109"] = "Порт и Пол Головки",
	["PartDesc-0109"] = "Среднее увеличение мощности двигателя",
				
	["PartName-0110"] = "Чертёж Блока",
	["PartDesc-0110"] = "Среднее увеличение мощности двигателя",
				
	["PartName-0111"] = "Коллекторы Выс Расхода",
	["PartDesc-0111"] = "Среднее увеличение мощности двигателя",
				
	["PartName-0123"] = "Stage 3 Твин Турбо Система",
	["PartDesc-0123"] = "Экстремальное увеличение мощности двигателя",

	--ECU
	["PartName-0201"] = "Регулятор Давления Топлива",
	["PartDesc-0201"] = "Среднее увеличение мощности двигателя",
		
	["PartName-0202"] = "Топливная Рейка",
	["PartDesc-0202"] = "Малое увеличение мощности двигателя",
		
	["PartName-0203"] = "Топливный Филтьр",
	["PartDesc-0203"] = "Малое увеличение мощности двигателя",
		
	["PartName-0204"] = "Чип Производительности",
	["PartDesc-0204"] = "Большое увеличение мощности двигателя",
		
	["PartName-0205"] = "Высокопоточный Топливный Насос",
	["PartDesc-0205"] = "Малое увеличение мощности двигателя",
			
	["PartName-0206"] = "Модуль Управ Двигателя",
	["PartDesc-0206"] = "Экстремальное увеличение мощности двигателя",
			
	["PartName-0207"] = "Топливный Инжектор",
	["PartDesc-0207"] = "Среднее увеличение мощности двигателя",
	
	--Transmission
	["PartName-0301"] = "Комплект Короткого Переключения",
	["PartDesc-0301"] = "Среднее сокращение времени переключения передач",
				
	["PartName-0302"] = "Облегченный Маховик",
	["PartDesc-0302"] = "Большое снижение веса маховика",
				
	["PartName-0305"] = "Высокоэффективное сцепление",
	["PartDesc-0305"] = "Большое сокращение времени переключения передач",
		
	["PartName-0306"] = "Высокоэффективная трансмиссия",
	["PartDesc-0306"] = "Добавляет передачу, повышает максимальную скорость",
	
	--Suspension
	["PartName-0401"] = "Спорт Пружины и Амортизаторы",
	["PartDesc-0401"] = "Малое уменьшение высоты",
				
	["PartName-0402"] = "Перекладина Стойки Башни",
	["PartDesc-0402"] = "Малое улучшение подвески",
				
	["PartName-0403"] = "Улучшенные Пружины и Амортизаторы",
	["PartDesc-0403"] = "Среднее уменьшение высоты",
				
	["PartName-0404"] = "Передние и Задние Планки",
	["PartDesc-0404"] = "Малое улучшение жесткости продольной балки",
				
	["PartName-0405"] = "Система Подвески с Койловерами",
	["PartDesc-0405"] = "Большое уменьшение высоты",
				
	["PartName-0406"] = "Ходовые Балки Большого Диаметра",
	["PartDesc-0406"] = "Большое улучшение жесткости ходовой балки",
		
	--Tires
	["PartName-0501"] = "Уличные Шины",
	["PartDesc-0501"] = "Среднее улучшение сцепления шин с дорогой",
				
	["PartName-0502"] = "Проффесиональные Шины",
	["PartDesc-0502"] = "Большое улучшение сцепления шин с дорогой",
				
	["PartName-0503"] = "Экстремальные Шины",
	["PartDesc-0503"] = "Экстремальное улучшение сцепления шин с дорогой",

	--Brakes
	["PartName-0601"] = "Уличные Колодки",
	["PartDesc-0601"] = "Среднее увеличение мощности тормозов",	
	
	["PartName-0602"] = "Стальные Тормозные Трубопроводы",
	["PartDesc-0602"] = "Малое увеличение мощности тормозов",
		
	["PartName-0603"] = "Роторы с Перекрестным Сверлением",
	["PartDesc-0603"] = "Среднее увеличение мощности тормозов",
		
	["PartName-0604"] = "Большой Диаметр Роторов",
	["PartDesc-0604"] = "Большое увеличение мощности тормозов",
		
	["PartName-0605"] = "Гоночные Колодки",
	["PartDesc-0605"] = "Большое увеличение мощности тормозов",
		
	["PartName-0606"] = "Роторы с Поперечным Сверлением и Шлицами",
	["PartDesc-0606"] = "Экстремальное увеличение мощности тормозов",
		
	["PartName-0607"] = "6 Поршневые Гоночные Суппорта",
	["PartDesc-0607"] = "Экстремальное увеличение мощности тормозов",	
	
	--Weight Reduction
	["PartName-0801"] = "Легкие Ковры",
	["PartDesc-0801"] = "Малое снижение веса",
				
	["PartName-0802"] = "Легкие внутренние панели",
	["PartDesc-0802"] = "Малое снижение веса",
				
	["PartName-0803"] = "Легкие окна",
	["PartDesc-0803"] = "Среднее снижение веса",
				
	["PartName-0804"] = "Легкие сиденья",
	["PartDesc-0804"] = "Среднее снижение веса",
				
	["PartName-0805"] = "Легкие Двери",
	["PartDesc-0805"] = "Большое снижение веса",
					
	["PartName-0806"] = "Внутренняя отделка с пенным наполнителем",
	["PartDesc-0806"] = "Среднее снижение веса",
	
	--Part Descriptions
	["Borpa"] = "Borpa"
}

return localization