local localization = {
	--Mod Name
	["CMSName"] = "Car Modification Shop",
	
	["Engine"] = "เครื่องยนต์",
    ["Ecu"] = "ECU",
    ["Transmission"] = "ระบบส่งกำลัง",
    ["Suspension"] = "ระบบระยะโค้ง",
    ["Tires"] = "ยางรถยนต์",
    ["Brakes"] = "เบรก",
    ["Weight Reduction"] = "ลดน้ำหนัก",
    ["Stage"] = "เวที",

    ["basetotalTorqueText"] = "แรงบิด: ",
    ["basetotalGearsText"] = "เฟือง: ",
    ["basetotalHeightText"] = "ความสูง: ",
    ["basetotalWeightText"] = "น้ำหนัก: ",
    ["basetotalTractionText"] = "สภาพการยึดเกาะของยาง: ",
    ["basetotalBrakePowerText"] = "แรงเบรก: ",
    ["basetotalPriceText"] = "ตะกร้าสินค้า: \n€$ ",

    ["ClearAllUpgrades"] = "ลบการอัปเกรดทั้งหมด",
    ["StopUpgradeClear"] = "หยุดการล้างอัปเกรด",
    ["ButtonStartDowngrading"] = "เริ่มการดาวน์เกรด",
    ["ButtonStopDowngrading"] = "หยุดการดาวน์เกรด",
    ["ButtonAcceptBroke"] = "ดำเนินการต่อ",
    ["ButtonReturn"] = "หน้าก่อนหน้า",
    ["ButtonConfirmUpgrade"] = "ยืนยันการอัปเกรด",
    ["CloseUIButton"] = "     ปิด",
    ["partBasketMainTextToSet"] = "ตะกร้าส่วน:",
    ["partListMainTextToSet"] = "ส่วนที่ได้รับการอัปเกรด:",
    ["descriptionPrice"] = "ราคา: ",
    ["brokeConfirmBox"] = "EDDIES ไม่เพียงพอ CHOOM\n   ไปหา EDDIES ก่อน\n        แล้วคุณสามารถพูดคุยได้",
    ["ButtonClearBasket"] = "ล้างตะกร้า",

    ["mapTitleText"] = "โรงรถ",
    ["mapDescText"] = "อัปเกรดยานพาหนะของคุณและชนะทุกคนในเมือง!",
    ["ButtonClearBasket"] = "ล้างตะกร้า",

	--Parts names and desc
	
	--Engine
	["PartName-0101"] = "รับอากาศเย็น",
	["PartDesc-0101"] = "เพิ่มแรงบิดเครื่องยนต์เล็กน้อย",

	["PartName-0102"] = "ส่วนหัวท่อไอเสีย",
	["PartDesc-0102"] = "เพิ่มแรงบิดเครื่องยนต์เล็กน้อย",

	["PartName-0103"] = "เพลาลูกเบี้ยวอ่อนและเกียร์แคม",
	["PartDesc-0103"] = "เพิ่มแรงบิดเครื่องยนต์เล็กน้อย",

	["PartName-0104"] = "ท่อไอเสียรถยนต์สมรรถนะสูง",
	["PartDesc-0104"] = "เพิ่มแรงบิดเครื่องยนต์เล็กน้อย",

	["PartName-0121"] = "Stage 1 Turbo System",
	["PartDesc-0121"] = "เพิ่มแรงบิดเครื่องยนต์ปานกลาง",

	["PartName-0105"] = "ท่อไอเสียแบบแคทแบ็ค",
	["PartDesc-0105"] = "เพิ่มแรงบิดเครื่องยนต์ปานกลาง",

	["PartName-0106"] = "ท่อร่วมไอดีไหลสูง",
	["PartDesc-0106"] = "เพิ่มแรงบิดเครื่องยนต์เล็กน้อย",

	["PartName-0107"] = "ท่อไอเสียเครื่องยนต์เส้นผ่านศูนย์กลางใหญ่ขึ้น",
	["PartDesc-0107"] = "เพิ่มแรงบิดเครื่องยนต์เล็กน้อย",

	["PartName-0122"] = "Stage 2 Turbo System",
	["PartDesc-0122"] = "เพิ่มแรงบิดเครื่องยนต์ขนาดใหญ่มาก",

	["PartName-0108"] = "เพลาลูกเบี้ยวแข่งและเกียร์แคม",
	["PartDesc-0108"] = "เพิ่มแรงบิดเครื่องยนต์ปานกลาง",

	["PartName-0109"] = "หัวเครื่องยนต์พอร์ตและโปแลนด์",
	["PartDesc-0109"] = "เพิ่มแรงบิดเครื่องยนต์ปานกลาง",

	["PartName-0110"] = "พิมพ์เขียวบล็อกเครื่องยนต์",
	["PartDesc-0110"] = "เพิ่มแรงบิดเครื่องยนต์ปานกลาง",

	["PartName-0111"] = "เฮดเดอร์ไอเสียไหลสูง",
	["PartDesc-0111"] = "เพิ่มแรงบิดเครื่องยนต์ปานกลาง",

	["PartName-0123"] = "Stage 3 Twin Turbo System",
	["PartDesc-0123"] = "การเพิ่มแรงบิดของเครื่องยนต์สุดโหด",

	--ECU
	["PartName-0201"] = "ตัวควบคุมแรงดันน้ำมันเชื้อเพลิง",
	["PartDesc-0201"] = "เพิ่มแรงบิดเครื่องยนต์ปานกลาง",

	["PartName-0202"] = "รางน้ำมันเชื้อเพลิง",
	["PartDesc-0202"] = "เพิ่มแรงบิดเครื่องยนต์เล็กน้อย",

	["PartName-0203"] = "กรองน้ำมันเชื้อเพลิง",
	["PartDesc-0203"] = "เพิ่มแรงบิดเครื่องยนต์เล็กน้อย",

	["PartName-0204"] = "ชิปประสิทธิภาพ",
	["PartDesc-0204"] = "เพิ่มแรงบิดเครื่องยนต์ขนาดใหญ่",

	["PartName-0205"] = "ปั๊มน้ำมันเชื้อเพลิงที่ไหลได้สูง",
	["PartDesc-0205"] = "เพิ่มแรงบิดเครื่องยนต์เล็กน้อย",

	["PartName-0206"] = "หน่วยจัดการเครื่องยนต์",
	["PartDesc-0206"] = "การเพิ่มแรงบิดของเครื่องยนต์สุดโหด",

	["PartName-0207"] = "ฉีดเชื้อเพลิง",
	["PartDesc-0207"] = "เพิ่มแรงบิดเครื่องยนต์ปานกลาง",
	
	--Transmission
	["PartName-0301"] = "ชุดเปลี่ยนเกียร์สั้น",
	["PartDesc-0301"] = "ลดเวลาเปลี่ยนเกียร์ปานกลาง",

	["PartName-0302"] = "โฟลวีลน้ำหนักเบา",
	["PartDesc-0302"] = "ลดน้ำหนักโฟลวีลขนาดใหญ่",

	["PartName-0305"] = "คลัตช์สูง",
	["PartDesc-0305"] = "ลดเวลาเปลี่ยนเกียร์ขนาดใหญ่",

	["PartName-0306"] = "ระบบส่งกำลังสูง",
	["PartDesc-0306"] = "เพิ่มเกียร์, ปรับปรุงความเร็วสูงสุด",
	
	--Suspension
	["PartName-0401"] = "สปริงกีฬาและช็อก",
	["PartDesc-0401"] = "ลดความสูงเล็กน้อย",

	["PartName-0402"] = "สตรัททาวเวอร์บาร์",
	["PartDesc-0402"] = "ปรับปรุงระบบระยะโค้งเล็กน้อย",

	["PartName-0403"] = "สปริงและช็อกสำหรับการแข่งขัน",
	["PartDesc-0403"] = "ลดความสูงปานกลาง",

	["PartName-0404"] = "สเวย์บาร์ด้านหน้าและด้านหลัง",
	["PartDesc-0404"] = "ปรับปรุงความแข็งของ Swaybar เล็กน้อย",

	["PartName-0405"] = "ระบบกันสะเทือนคอยล์โอเวอร์",
	["PartDesc-0405"] = "ลดความสูงขนาดใหญ่",

	["PartName-0406"] = "Swaybars ขนาดใหญ่",
	["PartDesc-0406"] = "ปรับปรุงความแข็งของ Swaybar ขนาดใหญ่",
		
	--Tires
	["PartName-0501"] = "ยางรถยนต์สำหรับการแข่งขันถนน",
	["PartDesc-0501"] = "ปรับปรุงความยึดเกาะของยางปานกลาง",

	["PartName-0502"] = "ยางรถยนต์สำหรับการแข่งขันมืออาชีพ",
	["PartDesc-0502"] = "ปรับปรุงความยึดเกาะของยางขนาดใหญ่",

	["PartName-0503"] = "ยางรถยนต์สำหรับการแข่งขันสุดโหด",
	["PartDesc-0503"] = "ปรับปรุงความยึดเกาะของยางสุดโหด",

	--Brakes
	["PartName-0601"] = "แผ่นยางเบรกถนน",
	["PartDesc-0601"] = "เพิ่มแรงบิดเบรกปานกลาง",

	["PartName-0602"] = "สายเบรกทอเหล็ก",
	["PartDesc-0602"] = "เพิ่มแรงบิดเบรกเล็กน้อย",

	["PartName-0603"] = "โรเตอร์เจาะรู",
	["PartDesc-0603"] = "เพิ่มแรงบิดเบรกปานกลาง",

	["PartName-0604"] = "โรเตอร์ขนาดใหญ่",
	["PartDesc-0604"] = "เพิ่มแรงบิดเบรกขนาดใหญ่",

	["PartName-0605"] = "แผ่นยางเบรกสำหรับการแข่งขัน",
	["PartDesc-0605"] = "เพิ่มแรงบิดเบรกขนาดใหญ่",

	["PartName-0606"] = "โรเตอร์เจาะรูและสล็อต",
	["PartDesc-0606"] = "การเพิ่มแรงบิดของเบรกสุดโหด",

	["PartName-0607"] = "คาลิเปอร์เรซซิ่งลูกสูบ 6 อัน",
	["PartDesc-0607"] = "การเพิ่มแรงบิดของเบรกสุดโหด",
	
	--Weight Reduction
	["PartName-0801"] = "พรมน้ำหนักเบา",
	["PartDesc-0801"] = "ลดน้ำหนักเล็กน้อย",

	["PartName-0802"] = "แผ่นภายในน้ำหนักเบา",
	["PartDesc-0802"] = "ลดน้ำหนักเล็กน้อย",

	["PartName-0803"] = "หน้าต่างน้ำหนักเบา",
	["PartDesc-0803"] = "ลดน้ำหนักปานกลาง",

	["PartName-0804"] = "ที่นั่งน้ำหนักเบา",
	["PartDesc-0804"] = "ลดน้ำหนักปานกลาง",

	["PartName-0805"] = "ประตูน้ำหนักเบา",
	["PartDesc-0805"] = "ลดน้ำหนักขนาดใหญ่",

	["PartName-0806"] = "ภายในเติมโฟม",
	["PartDesc-0806"] = "ลดน้ำหนักปานกลาง",
	
	--Part Descriptions
	["Borpa"] = "Borpa"
}

return localization