local localization = {
	--Mod Name
	["CMSName"] = "Car Modification Shop",
	
	--Part Types
	["Engine"] = "Двигун",
    ["Ecu"] = "Ecu",
	["Transmission"] = "Трансмісія",
	["Suspension"] = "Підвіска",
	["Tires"] = "Шини",
	["Brakes"] = "Гальма",
	["Weight Reduction"] = "Зменшення ваги",
	["Stage"] = "Стадія",

	--Totals text
	["basetotalTorqueText"] = "КРУТНИЙ M: ",
	["basetotalGearsText"] = "ПЕРЕДАЧІ: ",
	["basetotalHeightText"] = "ВИСОТА: ",
	["basetotalWeightText"] = "ВАГА: ",
	["basetotalTractionText"] = "ПРИХОПЛЮВАЛЬНА СИЛА ШИН: ",
	["basetotalBrakePowerText"] = "ГАЛЬМІВНИЙ КРУТНИЙ МОМЕНТ: ",
	["basetotalPriceText"] = "КОШИК: \n€$ ",

	--Main UI Text
	["ClearAllUpgrades"] = "Видалити всі оновлення",
	["StopUpgradeClear"] = "Зупинити видалення оновлень",
	["ButtonStartDowngrading"] = "Почати пониження",
	["ButtonStopDowngrading"] = "Зупинити пониження",
	["ButtonAcceptBroke"] = "Продовжити",
	["ButtonReturn"] = "Попередня сторінка",
	["ButtonConfirmUpgrade"] = "Підтвердити оновлення",
	["CloseUIButton"] = "     Закрити",
	["partBasketMainTextToSet"] = "КОШИК ЗАПЧАСТИН:",
	["partListMainTextToSet"] = "ОНОВЛЕНІ ЗАПЧАСТИНИ:",
	["descriptionPrice"] = "Ціна: ",
	["brokeConfirmBox"] = "НЕДОСТАТНЬО ЕДДІ, ДРУГ\n    ЗАРОБИ ДЕЯКІ ЕДДІ СПОЧАТКУ\n        ПОТІМ МИ МОЖЕМО ГОВОРИТИ",
	["ButtonClearBasket"] = "Очистити кошик",

	--MAP UI
	["mapTitleText"] = "Автомобільний гараж",
	["mapDescText"] = "Модернізуйте свої транспортні засоби та обгоните всіх у місті!",
	["ButtonClearBasket"] = "Очистити кошик",

	--Parts names and desc
	
	--Engine
	["PartName-0101"] = "Холодне повітряне впускання",
	["PartDesc-0101"] = "Невелике збільшення крутного моменту двигуна",

	["PartName-0102"] = "Заміна вихлопних колекторів",
	["PartDesc-0102"] = "Невелике збільшення крутного моменту двигуна",

	["PartName-0103"] = "Помірний розподільчий вал",
	["PartDesc-0103"] = "Невелике збільшення крутного моменту двигуна",

	["PartName-0104"] = "Спортивний вихлоп",
	["PartDesc-0104"] = "Невелике збільшення крутного моменту двигуна",

	["PartName-0121"] = "Турбосистема 1 стадії",
	["PartDesc-0121"] = "Середнє збільшення крутного моменту двигуна",

	["PartName-0105"] = "Система вихлопу Cat Back",
	["PartDesc-0105"] = "Середнє збільшення крутного моменту двигуна",

	["PartName-0106"] = "Високопроточний впускний колектор",
	["PartDesc-0106"] = "Невелике збільшення крутного моменту двигуна",

	["PartName-0107"] = "Випускний трубопровід більшого діаметру",
	["PartDesc-0107"] = "Невелике збільшення крутного моменту двигуна",

	["PartName-0122"] = "Турбосистема 2 стадії",
	["PartDesc-0122"] = "Дуже велике збільшення крутного моменту двигуна",

	["PartName-0108"] = "Гоночний розподільчий вал",
	["PartDesc-0108"] = "Середнє збільшення крутного моменту двигуна",

	["PartName-0109"] = "Портування голівок циліндрів",
	["PartDesc-0109"] = "Середнє збільшення крутного моменту двигуна",

	["PartName-0110"] = "Створення проекту блоку",
	["PartDesc-0110"] = "Середнє збільшення крутного моменту двигуна",

	["PartName-0111"] = "Високопроточні вихлопні колектори",
	["PartDesc-0111"] = "Середнє збільшення крутного моменту двигуна",

	["PartName-0123"] = "Турбосистема 3 стадії",
	["PartDesc-0123"] = "Екстремальне збільшення крутного моменту двигуна",

	--ECU
	["PartName-0201"] = "Регулятор тиску палива",
	["PartDesc-0201"] = "Середнє збільшення крутного моменту двигуна",

	["PartName-0202"] = "Паливна рейка",
	["PartDesc-0202"] = "Невелике збільшення крутного моменту двигуна",

	["PartName-0203"] = "Паливний фильтр",
	["PartDesc-0203"] = "Невелике збільшення крутного моменту двигуна",

	["PartName-0204"] = "Спортивний чіп",
	["PartDesc-0204"] = "Велике збільшення крутного моменту двигуна",

	["PartName-0205"] = "Високопроточний паливний насос",
	["PartDesc-0205"] = "Невелике збільшення крутного моменту двигуна",

	["PartName-0206"] = "Блок управління двигуном",
	["PartDesc-0206"] = "Екстремальне збільшення крутного моменту двигуна",

	["PartName-0207"] = "Паливні інжектори",
	["PartDesc-0207"] = "Середнє збільшення крутного моменту двигуна",

	--Transmission
	["PartName-0301"] = "Короткий перемикач передач",
	["PartDesc-0301"] = "Середнє скорочення часу перемикання передач",

	["PartName-0302"] = "Легкий маховик",
	["PartDesc-0302"] = "Велике зменшення ваги маховика",

	["PartName-0305"] = "Високопродуктивне зчеплення",
	["PartDesc-0305"] = "Велике скорочення часу перемикання передач",

	["PartName-0306"] = "Високопродуктивна трансмісія",
	["PartDesc-0306"] = "Додає передачу, покращує максимальну швидкість",

	--Suspension
	["PartName-0401"] = "Спортивні пружини та амортизатори",
	["PartDesc-0401"] = "Невелике зменшення висоти",

	["PartName-0402"] = "Стабілізатор поперечної стійкості",
	["PartDesc-0402"] = "Невелике поліпшення підвіски",

	["PartName-0403"] = "Спортивні пружини та амортизатори",
	["PartDesc-0403"] = "Середнє зменшення висоти",

	["PartName-0404"] = "Передні та задні стабілізатори",
	["PartDesc-0404"] = "Невелике поліпшення жорсткості стабілізатора",

	["PartName-0405"] = "Пружинно- амортизаторна підвіска",
	["PartDesc-0405"] = "Велике зменшення висоти",

	["PartName-0406"] = "Стабілізатори великого діаметру",
	["PartDesc-0406"] = "Велике поліпшення жорсткості стабілізатора",

	--Tires
	["PartName-0501"] = "Шини для вуличних перегонів",
	["PartDesc-0501"] = "Середнє поліпшення сцеплення шин",

	["PartName-0502"] = "Професійні шини для перегонів",
	["PartDesc-0502"] = "Велике поліпшення сцеплення шин",

	["PartName-0503"] = "Екстремальні шини для перегонів",
	["PartDesc-0503"] = "Екстремальне поліпшення сцеплення шин",

	--Brakes
	["PartName-0601"] = "Тормозні колодки для вулиці",
	["PartDesc-0601"] = "Середнє збільшення тормозного моменту",

	["PartName-0602"] = "Тормозні трубки зі сталевої оплеткою",
	["PartDesc-0602"] = "Невелике збільшення тормозного моменту",

	["PartName-0603"] = "Перфоровані тормозні диски",
	["PartDesc-0603"] = "Середнє збільшення тормозного моменту",

	["PartName-0604"] = "Тормозні диски великого діаметру",
	["PartDesc-0604"] = "Велике збільшення тормозного моменту",

	["PartName-0605"] = "Тормозні колодки для гонок",
	["PartDesc-0605"] = "Велике збільшення тормозного моменту",

	["PartName-0606"] = "Перфоровані і прорізані тормозні диски",
	["PartDesc-0606"] = "Екстремальне збільшення тормозного моменту",

	["PartName-0607"] = "6-поршневі гоночні супорти",
	["PartDesc-0607"] = "Екстремальне збільшення тормозного моменту",

	--Weight Reduction
	["PartName-0801"] = "Легкі килими",
	["PartDesc-0801"] = "Невелике зменшення ваги",

	["PartName-0802"] = "Легкі внутрішні панелі",
	["PartDesc-0802"] = "Невелике зменшення ваги",

	["PartName-0803"] = "Легкі вікна",
	["PartDesc-0803"] = "Середнє зменшення ваги",

	["PartName-0804"] = "Легкі сидіння",
	["PartDesc-0804"] = "Середнє зменшення ваги",

	["PartName-0805"] = "Легкі двері",
	["PartDesc-0805"] = "Велике зменшення ваги",

	["PartName-0806"] = "Інтер'єр, заповнений пінопластом",
	["PartDesc-0806"] = "Середнє зменшення ваги",
	
	--Part Descriptions
	["Borpa"] = "Borpa"
}

return localization